OpenFOAM-6-cantera/tutorials/multiphase/reactingTwoPhaseEulerFoam/laminar/steamInjection/0/U.steam
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U.steam;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0.1 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0.1 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.steam;
        value           $internalField;
    }
    walls
    {
        type            noSlip;
    }
}

// ************************************************************************* //
